%%% ----------------------------------------------------------------------------
%%% @author Oleg Muraviev <avesh.net@bk.ru>
%%%
%%% @doc Библиотека функций комбинаторики
%%% @end
%%% ----------------------------------------------------------------------------
-module(combinatorics).

%% API
-export([bin/2, perms/1]).

%% Tests
-include("tests/combinatorics_tests.erl").

%% -----------------------------------------------------------------------------
%% @doc Биномиальные коэффициенты
%% @end
%% -----------------------------------------------------------------------------
-spec bin(N, K) -> Return when
    N      :: non_neg_integer(),
    K      :: non_neg_integer(),
    Return :: non_neg_integer().

bin(N, K) when is_integer(N), is_integer(K), N >= 0, K >= 0 ->
    bin(N, K, {1, 1}).

%% тело binomial с аккумулятором
bin(N, K, {_, _}) when K > N ->
    0;
bin(_, 0, {P1, P2}) ->
    P1 div P2;
bin(N, K, {P1, P2}) ->
    bin(N-1, K-1, {P1*N, P2*K}).

%% -----------------------------------------------------------------------------
%% @doc Список всех перестановок из элементов исходного списка
%% @end
%% -----------------------------------------------------------------------------
-spec perms(L) -> Return when
    L      :: [any()],
    Return :: [[any()]].

perms([]) ->
    [[]];
perms(L) ->
    [[H|T] || H <- L, T <- perms(L--[H])].
