%%% ----------------------------------------------------------------------------
%%% @author Oleg Muraviev <avesh.net@bk.ru>
%%%
%%% @doc Библиотека работы с вещественными числами неограниченной точности
%%% @end
%%% ----------------------------------------------------------------------------
-module(real).

%% API -------------------------------------------------------------------------

%% Конструкторы и селекторы
-export([make/2]).

%% Константы
-export([]).

%% Арифметические операции
-export([]).

%% Предикаты
-export([]).

%% Операции сравнения
-export([]).

%% Преобразование типа
-export([]).

%% Tests -----------------------------------------------------------------------
-include("tests/real_tests.erl").

%% Тип - вещественное число неограниченной точности ----------------------------
-type real() :: {integer(),     %% мантиса
                integer()}.     %% показатель степени

%% -----------------------------------------------------------------------------
%% @doc Конструктор
%% @end
%% -----------------------------------------------------------------------------
-spec make(M, E) -> Return when
    M      :: integer(),
    E      :: integer(),
    Return :: real().

make(M, E) when is_integer(M), is_integer(E) -> {M, E}.
